---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.InvisibleRoomBoundElemement
source: html/a5f15b21-838e-1123-8584-c16a4904b4eb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.InvisibleRoomBoundElemement Property

[Room] Bounding element is invisible in current view.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvisibleRoomBoundElemement { get; }
```